//
//  Model.swift
//  QuicklySwift_Example
//
//  Created by rztime on 2022/6/20.
//  Copyright © 2022 CocoaPods. All rights reserved.
//

import UIKit

struct Model {
    var name = "rztime"
    var time = Date().qnoraml
    
    let ip = ["成都", ""][Int.random(in: 0..<2)]
    let content = [
        "",
        
        """
        《呐喊》是现代文学家鲁迅的短篇小说集
        """,
        
        """
        收录鲁迅于1918年至1922年所作的14篇短篇小说，1923年由北京新潮社出版，现编入《鲁迅全集》第1卷。小说集真实地描绘了从辛亥革命到五四运动时期的社会生活，从革命民主主义出发，抱着启蒙主义目的和人道主义精神，揭示了种种深层次的社会矛盾，对旧时中国的制度及部分陈腐的传统观念进行了深刻的剖析和比较彻底的否定，表现出对民族生存浓重的忧患意识和对社会变革的强烈希望
        """,
        
        "《呐喊》是中国现代小说的开端与成熟的标志，开创了现代现实主义文学的先河。",
        
        "作品通过写实主义、象征主义、浪漫主义等多种手法，以传神的笔触和“画眼睛”、“写灵魂”的艺术技巧，形象生动地塑造了狂人、孔乙己、阿Q等一批不朽的艺术形象，深刻反映了19世纪末到20世纪20年代间中国社会生活的现状，有力揭露和鞭挞了封建旧恶势力，表达了作者渴望变革，为时代呐喊，希望唤醒国民的思想。奠定了鲁迅在中国现代文学史和现代文化史上的地位",
        
        "1985年，日本出版的50卷本《世界最高杰作》，中国仅有《呐喊》与《论语》被收入 [3]  ；1999年6月，《呐喊》被《亚洲周刊》评选为20世纪中文小说100强之首。"
        
    ][Int.random(in: 0..<6)]
    let images = [
        [""],
        ["1"],
        ["1", "2"],
        ["1", "2", "3"],
        ["1", "2", "3", "4"],
        ["1", "2", "3", "4", "5"],
        ["1", "2", "3", "4", "5", "6"],
        ["1", "2", "3", "4", "5", "6", "7"],
        ["1", "2", "3", "4", "5", "6", "7", "8"],
        ["1", "2", "3", "4", "5", "6", "7", "8", "9"],
        ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10"],
        ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"],
    ][Int.random(in: 0..<12)]
    
    let isfollow = [true, false][Int.random(in: 0..<2)]
    
    let flag = ["", "热门", "推荐", "已关注的话题", "1  2  3"][Int.random(in: 0..<5)]
}
